/* ДЗ №5: Масиви та регулярні вирази */

/* Створюємо регулярний вираз */
const regex = /^[^aA]{6,}$/;

/* Пояснення по кожному фрагменту:
По-перше, ^ та $ - зрозуміло, це початок та кінець слова відповідно ;
По-друге, [^aA] - передає значення будь-якого символу,
за виключенням малої "a" або великої "A" відповідно;
По-третє, {6,}  - говорить "повтори 6 та(або) більше разів". */

/* Наш масив слів із Умов Домашки та тих слів, котрі пройшли перевірку */
const words = ["Wonderful", "Joyful", "Happiness", "Time", "Task", "Apple"];
const matchedWords = [];

/* Перебірка нашого масиву через цикл, а метод .test() повертає нам значення true,
за умови якщо будь-яке зі слів відповідає регулярному виразу */
for (let i = 0; i < words.length; i++) {
    let currentWord = words[i];
    
    if (regex.test(currentWord)) {
        matchedWords.push(currentWord);
    }
}

console.log("Слова, що пройшли перевірку:", matchedWords);